In [1]:
import pandas as pd

In [6]:
d = {'A': [23,34,53,21,23],'B': [97,87,90,87,76],'C': [76,53,76,87,76]}

In [7]:
df =pd.DataFrame(d)
df

    A   B   C
0  23  97  76
1  34  87  53
2  53  90  76
3  21  87  87
4  23  76  76

In [10]:
df['B'].unique() #returns all unique values in column

array([97, 87, 90, 76], dtype=int64)

In [13]:
df['B'].nunique() #no of unique values in col

4

In [15]:
df['C'].value_counts() #how many times each unique value occured

76    3
53    1
87    1
Name: C, dtype: int64

In [16]:
def twice(x):
    return x*2

In [20]:
df['A'].apply(twice) #applying a custom method

0     46
1     68
2    106
3     42
4     46
Name: A, dtype: int64

In [21]:
df.sort_values('C')

    A   B   C
1  34  87  53
0  23  97  76
2  53  90  76
4  23  76  76
3  21  87  87